export const eventList = [
    {
        id: 1,
        title: "沈阳大东副食品商场爆炸",
        description: "辽宁省沈阳市沈河区东顺城街“大东副食品商场”门口街道上，发生不明物件爆炸。爆炸点站满了排队人潮，爆炸声响威力强大，画面中可见多人流血倒地、受伤、仓皇奔跑，烟雾弥漫，有电动车遭严重损毁。值得关注的是，习近平于3天前、23日上午，人就在沈阳大东副食品商场和大东区长安街道，考察年节前夕市场供应和民众生活等情况。",
        newsCount: 10,
        latestNews: {
            title: "墙内平行时空里，应有尽有，不应有则根据相关法律法规不予显示",
            time: "1小时前",
        }
    },
    {
        id: 2,
        title: "比亚迪”黑奴工”事件",
        description: "巴西因工人生活条件恶劣如“奴隶”，叫停比亚迪工厂建设，并解救160多名中国雇工。比亚迪终止合作并承诺守法。",
        newsCount: 20,
        latestNews: {
            title: "比亚迪巴西工厂施工方涉非法招工？外交部回应：中国政府一贯要求中资企业依法依规经营",
            time: "1小时前",
        }
    },
    {
        id: 3,
        title: "台湾舔共网红“闽南狼“反水揭露中共统战内幕",
        description: "台籍网红陈柏源长期以“闽南狼PYC”身分活跃中国市场，他一改其“小粉红”的政治立场，于12月6日发布一部纪录片，曝光他卧底记录中共基层统战单位收买台湾网红的手段，引发两岸哗然。对此，中国国台办斥为“民进党政府发起的认知战”。但台湾学者说，此纪录片的最大价值在于取得第一手证据，验证了外界对中共行为的长期质疑。",
        newsCount: 10,
        latestNews: {
            title: "闽南狼陈柏源和台湾网红八炯合作歌曲。呼吁国民党一起反共复国，把台湾还给台湾人！",
            time: "1小时前",
        }
    },
    {
        id: 4,
        title: "李宜雪“被精神病”事件",
        description: "2022年3月中旬，因一起民事纠纷，李宜雪到丁公路派出所报警，但派出所不予立案。接下来的一段时间里，李宜雪为这起纠纷多次来到丁公路派出所。4月14日，李宜雪再一次来到丁公路派出所询问案件进展，第一次见到辅警赖某吉。赖某吉主动电话联系了李宜雪，说这起案子他可以帮忙，要见面聊。[2] 李宜雪称，次日下午赖某约见她到附近一家酒店的房间聊案子，之后赖某欲行不轨，双方僵持一晚李宜雪没有选择报警。4月21日晚李宜雪在某商场三层高的栏杆处吹风，保安认为其要跳楼而报警，丁公路派出所接警并到场沟通，沟通期间李宜雪提及辅警赖某猥亵，此后民警将其带回派出所，送至江西省精神病院长达56日。",
        newsCount: 10,
        latestNews: {
            title: "1月25日(发布) 男子向有关部门举报南昌公安阻止热心市民看望李宜雪。遭到工作人员一顿回怼：你是她什么人，跟你有关系吗？",
            time: "1小时前",
        }
    },
    {
        id: 5,
        title: "美国一民航客机与军用直升机相撞坠河事件",
        description: "2025年1月29日晚，美国一架载有64人的客机在华盛顿罗纳德·里根国家机场附近与一架军用直升机相撞后坠入波托马克河。直升机上有3名军人。救援在严寒中连夜进行，伤亡未明。特朗普称事故“本可避免”。机场暂停航班至次日早晨。这是美国十多年来最严重的空难。",
        newsCount: 10,
        latestNews: {
            title: "美国国家运输安全委员会称，客机与直升机相撞原因尚不明确，将展开调查。",
            time: "1小时前",
        }
    },
    {
        id: 6,
        title: "新冠溯源美中争端再起",
        description: "新冠溯源问题在美国国内持续争议，成为影响中美关系紧张的重要因素之一。武汉病毒研究所成为了溯源讨论的核心焦点。中国外交部对此回应，指责美国在疫情溯源问题上进行政治化操作，试图借此抹黑中国，强调相关指控缺乏事实依据。",
        newsCount: 10,
        latestNews: {
            title: "美国国家安全顾问：美国政府将对中国新冠病毒溯源问题展开调查",
            time: "1小时前",
        }
    },
    {
        id: 7,
        title: "阿萨德政权倒台",
        description: "叙利亚总统巴沙尔·阿萨德政权倒台，叙利亚民主军接管政权。叙利亚民主军宣布，将在未来两年内进行自由选举，选出新一届政府。",
        newsCount: 10,
        latestNews: {
            title: "叙利亚民主军宣布，将在未来两年内进行自由选举，选出新一届政府。",
            time: "1小时前",
        }
    },
    {
        id: 8,
        title: "李老师发行迷因币$LI，被质疑割韭菜",
        description: "李老师发行迷因币$LI，被质疑割韭菜。李老师称，$LI是一种社区币，用于社区治理。",
        newsCount: 10,
        latestNews: {
            title: "李老师发行迷因币$LI，被质疑割韭菜",
            time: "1小时前",
        }
    }
]

export const searchRank = [
    {
        index: 0,
        keyword: "远洋捕捞",
    },
    {
        index: 1,
        keyword: "比亚迪",
    },
    {
        index: 2,
        keyword: "沈阳",
    },
    {
        index: 3,
        keyword: "李老师",
    }
]


export const clickRank = [
    {
        index: 0,
        newsTitle: "沈阳大东副食品商场爆炸",
    },
    {
        index: 1,
        newsTitle: "比亚迪”黑奴工”事件",
    },
    {
        index: 2,
        newsTitle: "台湾舔共网红“闽南狼“反水揭露中共统战内幕",
    },
    {
        index: 3,
        newsTitle: "李宜雪“被精神病”事件",
    }
]

export const homeTabs = [
    {
        index: 0,
        title: "热点事件",
        path: "/home/event",
    },
    {
        index: 1,
        title: "事件跟踪",
        path: "/home/track"
    },
    {
        index: 2,
        title: "实时新闻",
        path: "/home/news"
    },
    {
        index: 3,
        title: "我关注的",
        path: "/home/followed"
    },
    {
        index: 4,
        title: "更多内容",
        path: "/home/more"
    }
]